---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.AttemptToConnectNonSlopingElementToSlopedPipeWarning
source: html/213eaf22-602c-6f16-2aa2-a8fdb9aec60b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.AttemptToConnectNonSlopingElementToSlopedPipeWarning Property

You have specified that sloped pipe be drawn, but are trying to connect to an element that doesn't support sloping connections.

## Syntax (C#)
```csharp
public static FailureDefinitionId AttemptToConnectNonSlopingElementToSlopedPipeWarning { get; }
```